import colorama
from colorama import Fore
import os 
import csv 
import sys

Red = Fore.RED 
Yellow = Fore.YELLOW 
Reset = Fore.RESET 

print(f"{Yellow}Введите юзернейм{Reset}")

def юзернейм():
    input()
    
if input() == "Sakuzuna":
    print(f"{Red}Юзернейм подошел{Reset}")
    print(f"{Red}Введите пароль{Reset}")
else:
    print(f"{Red}Неправильный юзернейм{Reset}")
    exit()

if input() == "YaPidar":
    print(f"{Red}Пароль подошел{Reset}")
    print(f"{Red}Нажмите ENTER для запуска софта{Reset}")
else:
    print(f"{Red}Неправильный пароль{Reset}")
    exit()
    
юзернейм()

print(f"""{Fore.RED} 
  .--.--.                     ,-.                                                                  
 /  /    '.               ,--/ /|                                                                  
|  :  /`. /             ,--. :/ |          ,--,        ,----,         ,--,      ,---,              
;  |  |--`              :  : ' /         ,'_ /|      .'   .`|       ,'_ /|  ,-+-. /  |             
|  :  ;_      ,--.--.   |  '  /     .--. |  | :   .'   .'  .'  .--. |  | : ,--.'|'   |  ,--.--.    
 \  \    `.  /       \  '  |  :   ,'_ /| :  . | ,---, '   ./ ,'_ /| :  . ||   |  ,"' | /       \   
  `----.   \.--.  .-. | |  |   \  |  ' | |  . . ;   | .'  /  |  ' | |  . .|   | /  | |.--.  .-. |  
  __ \  \  | \__\/: . . '  : |. \ |  | ' |  | | `---' /  ;--,|  | ' |  | ||   | |  | | \__\/: . .  
 /  /`--'  / ," .--.; | |  | ' \ \:  | : ;  ; |   /  /  / .`|:  | : ;  ; ||   | |  |/  ," .--.; |  
'--'.     / /  /  ,.  | '  : |--' '  :  `--'   \./__;     .' '  :  `--'   \   | |--'  /  /  ,.  |  
  `--'---' ;  :   .'   \;  |,'    :  ,      .-./;   |  .'    :  ,      .-./   |/     ;  :   .'   \ 
           |  ,     .-./'--'       `--`----'    `---'         `--`----'   '---'      |  ,     .-./ 
            `--`---'                                                                  `--`---'     
                                                                                                   
    
         ╔════════════════════════════════════════════════════════════════════╗
         ║ Софт был написан во временна древних Римляней так что не осуждайте ║                                                            
         ╚════════════════════════════════════════════════════════════════════╝     
         ╔════════════════════════════════════════════════════════════════════╗
         ║                         <Введите ваш запрос>                       ║
         ╚════════════════════════════════════════════════════════════════════╝ 
 {Reset}""")

input(f"{Yellow}Введите запрос{Reset}")

def search_files(query):
    # Путь к папке "data" вы можете поменять название папке просто поменяв нащвание папки в 51-ой строке
    data_dir = os.path.join(os.getcwd(), 'data')

    # Посик по базам в папке "data"
    for filename in os.listdir(data_dir):
        # Проверка формата файлов
        if filename.endswith(('.txt', '.csv', '.xlsx')):
            # Чтение баз
            filepath = os.path.join(data_dir, filename)
            with open(filepath, 'r') as file:
                for line_num, line in enumerate(file, start=1):
                    # Найдено/Не найдено
                    if query in line:
                        # Есл найдено то
                        print(f"File: {filename}, Line {line_num}: {line.strip()}")

# Пример:
query = '7999999999'
search_files(query)
